// Написать программу, которая из имеющищегося массива строк
// формирует массив из строк, длина которых меньше либо равна 3.


string[] newArray = { "hello", "2", "world", ":-)" };
Console.WriteLine(string.Join(", ", newArray ));
for (int i = 0; i < newArray.Length; i++)
{
    if newArray[i] 
}

