// Задача 64: Задайте значение N. Напишите программу, 
// которая выведет все натуральные числа в промежутке от N до 1.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

int n = 5;
void Print1ToN(int n)
{   
    Console.Write($"{n} ");
    if (n == 1) return;
    Print1ToN(n - 1);
    
}

Print1ToN(n);