// Задача 13: Напишите программу, которая 
// выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет. (номер цифры считается от левого края)
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.WriteLine("Введите число ");
int number = Convert.ToInt32(Console.ReadLine());
int num = 


Console.WriteLine(number);


    
   
